{
    "callForPapers": {
        "deadline": "2017-08-01",
        "start": "2017-07-01",
        "url": "https://goo.gl/forms/KcQcN7WIkrTNlkxY2"
    },
    "city": "Bagé",
    "date": "2017-08-26",
    "enrollment": {
        "availability": 200,
        "closed": false,
        "deadline": "2017-08-25",
        "start": "2017-07-26",
        "url": "https://goo.gl/forms/oqdZJaX1LlIF0eUf1"
    },
    "id": "bage",
    "institution": {
        "address": "",
        "courses": [
            {
                "name": "Engenharia da Computação",
                "url": "http://cursos.unipampa.edu.br/cursos/engenhariadecomputacao/"
            }
        ],
        "latitude": -31.306729,
        "logo": "unipampa.png",
        "long_name": "UNIPAMPA Campus Bagé",
        "longitude": -54.063899,
        "short_name": "UNIPAMPA",
        "url": "http://porteiras.unipampa.edu.br/bage/"
    },
    "rooms": [
        {
            "number": "1",
            "subject": ""
        },
        {
            "number": "2",
            "subject": ""
        },
        {
            "number": "3",
            "subject": ""
        },
        {
            "number": "4",
            "snebject": ""
        }
    ],
    "schedule": {
        "08:30": [
            {
                "abstract": "",
                "author": "",
                "keywords": "credenciamento",
                "level": "all",
                "resume": "",
                "room": "",
                "title": "Credenciamento"
            }
        ],
        "09:00": [
            {
                "abstract": "",
                "author": "Leonardo Vaz",
                "keywords": "abertura",
                "level": "all",
                "resume": "",
                "room": "",
                "title": ""
            }
        ],
        "09:30": [
            {
                "abstract": "O Git é uma ferramenta para control e gerenciamento de código fonte, inicialmente projetado e desenvolvido por Linus Torvalds para o desenvolvimento do kernel Linux, porém adotado por muitos outros projetos posteriormente devido a suas características e velociada. Nesta palestra veremos uma introdução ao Git e seus principais casos de uso dentro do fluxo de trabalho de um desenvolvedor. ",
                "author": "Leonardo Vaz",
                "keywords": "Git, SCM",
                "level": "Principiante",
                "resume": "Distribuições Linux e Aplicações Livres, Desenvolvimento, Banco de Dados e Web",
                "room": "2",
                "title": "Git para Desenvolvedores"
            },
            {
                "abstract": "Voltada para todos os tipos de público, é uma apresentação / comparação sobre as tecnologias atuais em relação às disponíveis há 10 ou 15 anos atrás. Distribuições de Software, configuração de hardware, programas, redes sociais: o quanto isso pode mudar em 15 anos? ",
                "author": "Fabio Beneditto",
                "keywords": "tecnologia, linux, história, experiência pessoal",
                "level": "Principiante",
                "resume": "Comunidade e Filosofia",
                "room": "1",
                "title": "...porque no MEU TEMPO: Comparativo entre algumas tecnologias atuais com 10+ anos atrás"
            },
            {
                "abstract": "Com o surgimento de bancos de dados não relacionais, nasceram também novas soluções para diversos problemas, e por incrível que pareça não necessariamente isso precisa ser complexo. O objetivo dessa apresentação é demonstrar como é possível escalar de forma fácil e rápida um cluster de Mongo utilizando como backend o Docker.",
                "author": "Cristiano dos Santos Diedrich",
                "keywords": "Docker, Mongo, Docker Compose, Docker Cluster, Container, DevOps",
                "level": "Intermediario",
                "resume": "Desenvolvimento, Banco de Dados e Web",
                "room": "3",
                "title": "Escalando MongoDB com Docker"
            },
            {
                "abstract": "VIM é um editor único, com uma forma única que poucos editores copiam. Entender como ele funciona não só é útil por sua ubiquidade, como também para aumentar sua produtividade.",
                "author": "Julio Biason",
                "keywords": "vim, editores",
                "level": "Principiante",
                "resume": "Julio Biason foi apresentado ao VIM em 2000 e desde então, apesar de ter passado por praticamente todo editor de programação do planeta, sempre voltou ao VIM.",
                "room": "4",
                "title": "A Gramática do VIM"
            }
        ],
        "10:30": [
            {
                "abstract": "Atualmente fala-se muito em arquitetura em microserviços, mas o que realmente é um microserviço, o que ele resolve? O que ele não resolve? É possível eu implementar isso no meu ambiente? Vamos conversar e descobrir juntos essas respostas.",
                "author": "Cristiano dos Santos Diedrich",
                "keywords": "Docker, Microserviços, Microservices, DevOps",
                "level": "Intermediario",
                "resume": "Kernel, Sistemas Embarcados e Internet das Coisas",
                "room": "2",
                "title": "Desmistificando Microserviços"
            },
            {
                "abstract": "Mostrar como criar um compartilhamento simples utilizando o Samba, via terminal",
                "author": "Fabrício Denis Perez",
                "keywords": "Samba compartilhamento simples",
                "level": "Principiante",
                "resume": "Administração de Sistemas,  Redes e Segurança",
                "room": "3",
                "title": "Samba simples"
            },
            {
                "abstract": "Porque faz sentido ajudar em projetos open source e como começar a participar.",
                "author": "Julio Biason",
                "keywords": "open source, comunidade, participação",
                "level": "Principiante",
                "resume": "Comunidade e Filosofia",
                "room": "1",
                "title": "Por que e Como Participar de Projetos Open Source"
            },
            {
                "abstract": "Um resumo sobre a Suite Livre OpenOffice, uma síntese, os principais componentes, a compatibilidade com a suíte proprietária da MS, a compatibilidade com os principais sistemas operacionais e uma breve demonstração de suas ferramentas principais.",
                "author": "Luis Ivan Douradp Ritta",
                "keywords": "LibreOffice, OpenOffice, Suite de Escritório",
                "level": "Principiante",
                "resume": "Distribuições Linux e Aplicações Livres, Empreendedorismo e Negócios",
                "room": "4",
                "title": "OpenOffice/LibreOffice - A Suite Livre"
            }
        ],
        "11:30": [
            {
                "abstract": "",
                "author": "",
                "keywords": "intervalo",
                "level": "",
                "resume": "",
                "room": "",
                "title": "Intervalo de Almoço"
            }
        ],
        "13:00": [
            {
                "abstract": "Docker é uma das tecnologias do momento, mas você sabe o que é? Onde utilizá-lo? Quais problemas ele resolve? O objetivo dessa apresentação é responder essas questões e mostrar porque todo mundo só fala dele.",
                "author": "Cristiano dos Santos Diedrich",
                "keywords": "Docker, Container, DevOps",
                "level": "Principiante",
                "resume": "Administração de Sistemas,  Redes e Segurança",
                "room": "1",
                "title": "Docker para iniciantes"
            },
            {
                "abstract": "Escrever testes é uma prática comum no desenvolvimento de software. Mas estamos escrevendo testes de forma errada. E eu vou explicar o que há de errado na forma de ver unit testes hoje em dia.",
                "author": "Julio Biason",
                "keywords": "desenvolvimento, testes, unit tests",
                "level": "Intermediario",
                "resume": "Desenvolvimento, Banco de Dados e Web",
                "room": "2",
                "title": " O \"Unit\" de \"Unit tests\" "
            },
            {
                "abstract": "Por que a Microsoft está dando treinamentos gratuitos sobre Python? Como a Apple consegue vender seus produtos a preço de ouro mesmo que não sejam os melhores no mercado? Por que cada vez mais profissionais contribuem para projetos de código aberto? Como cinquenta tons de cinza se tornou o best seller mais rapidamente vendido no Reino Unido? Por quanto tempo um profissional deve estudar para se destacar no mercado e ser considerado um especialista? Existe uma fórmula exata para alcançar o sucesso? As respostas para essas perguntas e muitas outras serão apresentadas nesta palestra! Diversas de lições de grandes empresas e empresários de sucesso serão repassadas com o intuito de fornecer um \"Norte\" para aqueles que ainda iniciando a molhar os pés nos profundos mares do mundo trabalhista, demonstrando diversos sistemas e teorias que movem a economia moderna.",
                "author": "Jerônimo Medina Madruga",
                "keywords": "Empreendedorismo, Economia, Comunidade, Filosofia, Networking",
                "level": "Principiante",
                "resume": "Empreendedorismo e Negócios, Comunidade e Filosofia",
                "room": "4",
                "title": "Dê a cara a tapa: 5 Estratégias para chutar o traseiro da concorrência e ser um profissional de sucesso"
            },
            {
                "abstract": "(de 2 a 3 slots) Fundamentos, comandos básicos, pedindo ajuda, encadeamento de comandos,  fazendo um mini script, etc.",
                "author": "Sandro Custódio",
                "keywords": "bash, terminal, linha de comando",
                "level": "Principiante",
                "resume": "Distribuições Linux e Aplicações Livres, Administração de Sistemas,  Redes e Segurança",
                "room": "3",
                "title": "Bash, linha de comando"
            }
        ],
        "14:00": [
            {
                "abstract": "O tema Computação em Nuvem é vastamente usado nos dias de hoje, todavia se trata de um conceito um tanto abstrato para muitas pessoas. Nesta apresentação serão abordados os principais componentes de soluções de Computação em Nuvem, conceitos básicos como IaaS, PaaS e SaaS, e também os principais projetos de Open Source Cloud como Openstack, Openshift entre outros. ",
                "author": "Leonardo Vaz",
                "keywords": "Cloud, Iaas, Paas, SaaS",
                "level": "Principiante",
                "resume": "Virtualização, Big Data e Cloud Computing",
                "room": "1",
                "title": " Tudo o que você sempre quis saber sobre Open Source Cloud Computing, mas tinha medo de perguntar! "
            },
            {
                "abstract": "Você sabe o que é um projeto? Alguma vez já se perguntou? Muitas vezes não sabemos essa resposta mesmo depois de estarmos no mercado de trabalho. Mas por que é importante aprender gestão de projetos se eu não tenho interesse em gerenciar equipes ou projetos? Falarei nessa palestra sobre a importância de se estudar gerenciamento de projetos, independente da carreira que queiras seguir.",
                "author": "Rodrigo Ferro ",
                "keywords": "Gestão de projetos, projetos, produtividade ",
                "level": "Principiante",
                "resume": "Distribuições Linux e Aplicações Livres, Administração de Sistemas,  Redes e Segurança, Desenvolvimento, Banco de Dados e Web, Virtualização, Big Data e Cloud Computing, Kernel, Sistemas Embarcados e Internet das Coisas, Empreendedorismo e Negócios, Comunidade e Filosofia",
                "room": "2",
                "title": "Por que devemos estudar gestão de projetos? "
            }
        ],
        "15:00": [
            {
                "abstract": "",
                "author": "",
                "keywords": "intervalo",
                "level": "",
                "resume": "",
                "room": "",
                "title": "Coffe-break"
            }
        ],
        "15:30": [
            {
                "abstract": "O Ceph é um sistema de storage distribuído e unificado que foi desenhado para ter uma excelente performance, confiabilidade e escalabilidade, e é considerado por muitos com o \"Futuro do Storage\". Nesta apresentação será abordada a arquitetura do Ceph e também seus principais casos de uso.",
                "author": "Leonardo Vaz",
                "keywords": "Ceph, SDS, Storage",
                "level": "Intermediario",
                "resume": "Virtualização, Big Data e Cloud Computing",
                "room": "1",
                "title": "Introdução ao Ceph "
            },
            {
                "abstract": "Nessa palestra irei falar sobre como podemos dar os primeiros passos na utilização de metodologias ágeis de projeto, utilizando SCRUM e MVP (mínimo produto viável). Vou falar sobre a teoria e como podemos aplicar na nossa vida profissional ou acadêmica.",
                "author": "Rodrigo Ferro ",
                "keywords": "SCRUM, MVP, Agile ",
                "level": "Principiante",
                "resume": "Administração de Sistemas,  Redes e Segurança, Desenvolvimento, Banco de Dados e Web, Empreendedorismo e Negócios",
                "room": "2",
                "title": "Dando os primeiros passos com SCRUM "
            },
            {
                "abstract": "Explicar a função básica de um Proxy em um Rede de Computadores, vantages e desvantagens.",
                "author": "Fabrício Denis Perez",
                "keywords": "Proxy Squid Rede",
                "level": "Principiante",
                "resume": "Administração de Sistemas,  Redes e Segurança",
                "room": "3",
                "title": "Proxy Squid - função e aplicação"
            },
            {
                "abstract": "Você fica perdido ao tentar aprender sobre software livre? Não sabe qual linguagem aprender primeiro? Não entende como as pessoas aprendem sozinhas a mexer naquela tela preta que chamam linha de comando? Já cansou de investir em cursos onde tudo parece um bixo de 7 cabeças? Não se desespere mais, pois está palestra é para você! Em um formato no estilo desconferência, serão apresentados os melhores métodos para se familiarizar com linguagens de programação, os principais cursos online no momento, como aprender de forma efetiva e sem decoreba, como fazer para tirar dúvidas que você não sabe perguntar ao Google e também como contribuir de forma a ajudar outras pessoas!",
                "author": "Jerônimo Medina Madruga",
                "keywords": "Aprendizado, Software Livre, Free as in Free Beer, EAD",
                "level": "Principiante",
                "resume": "Distribuições Linux e Aplicações Livres, Desenvolvimento, Banco de Dados e Web",
                "room": "4",
                "title": "Como aprender sobre software livre com qualidade e sem gastar (quase) nenhum tostão do bolso?"
            }
        ],
        "16:30": [
            {
                "abstract": "",
                "author": "Leonardo Vaz",
                "keywords": "encerramento",
                "level": "all",
                "resume": "",
                "room": "",
                "title": "Painel: Software Livre e o Mercado de Trabalho"
            }
        ]
    },
    "sponsors": [],
    "support": []
}
